# Задача-1: Дано произвольное целое число, вывести поочередно цифры исходного числа
number = 87449
print(number // 10)
i = 1
while i < 10:
    i = i + 1
    print(i)
# код пишем тут...

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Не нужно решать задачу так: print("a = ", b, "b = ", a) - это неправильное решение!

# Задача-3: Запросите у пользователя год рождения. Если ему есть 18 лет, выведите: "Доступ разрешени"
# иначе "Извините, пользование данным ресурсом только с 18 лет"
